def rouge_skill_choice(archetype):
    rouge_skill_map = {
        'авантюрист': [ 
            "Ловкость рук",
            "Подделка"
        ],
        'судья': [
            "один прием",
            "Акробатика",
            "Вскрытие замков",
            "Карманная кража",
            "Ловкость рук",
            "Незаметность",
            "Отключение устройств",
            "Подделка",
            "Подкрадывание",
            "Слабое место"
        ],
        'налетчик': [ # Налётчик
            "Акробатика",
            "Подкрадывание"
        ],
        'следопыт': [
            "Незаметность",
            "Подкрадывание"
        ],
        'ронин': [
            "Слабое место"
        ],
        'поджигатель': [
            "Акробатика",
            "Незаметность",
            "Подкрадывание"
        ],
        'вор': [
            "четыре приема",
            "Акробатика",
            "Вскрытие замков",
            "Карманная кража",
            "Ловкость рук",
            "Незаметность",
            "Отключение устройств",
            "Подделка",
            "Подкрадывание",
            "Слабое место"
        ],
        'ремесленник': [
            "Вскрытие замков",
            "Отключение устройств",
            "Подделка"
        ],
        'скиталец': [
            "Вскрытие замков",
            "Ловкость рук"
        ]
    }
    return rouge_skill_map[archetype.lower()]