def specifications_choice(archetype):
    traits_map = {
        'авантюрист': [
            """
            1️⃣ Мощь -1
            2️⃣ Сноровка 0
            3️⃣ Удача 0
            4️⃣ Хитрость 1
            5️⃣ Шарм 2
            """,
            "-1", "0", "0", "1", "2"
        ],
        'судья': [
            """
            1️⃣ Мощь 2
            2️⃣ Сноровка 0
            3️⃣ Удача -1
            4️⃣ Хитрость 0
            5️⃣ Шарм 1
            """,
            "2", "0", "-1", "0", "1"
        ],
        'налетчик': [
            """
            1️⃣ Мощь 0
            2️⃣ Сноровка 2
            3️⃣ Удача 1
            4️⃣ Хитрость -1
            5️⃣ Шарм 0
            """,
            "0", "2", "1", "-1", "0"
        ],
        'следопыт': [
            """
            1️⃣ Мощь 1
            2️⃣ Сноровка 1
            3️⃣ Удача 0
            4️⃣ Хитрость 1
            5️⃣ Шарм -1
            """,
            "1", "1", "0", "1", "-1"
        ],
        'ронин': [
            """
            1️⃣ Мощь 2
            2️⃣ Сноровка 0
            3️⃣ Удача -1
            4️⃣ Хитрость 1
            5️⃣ Шарм 0
            """,
            "2", "0", "-1", "1", "0"
        ],
        'поджигатель': [
            """
            1️⃣ Мощь 0
            2️⃣ Сноровка 0
            3️⃣ Удача 2
            4️⃣ Хитрость -1
            5️⃣ Шарм 1
            """,
            "0", "0", "2", "-1", "1"
        ],
        'вор': [
            """
            1️⃣ Мощь -1
            2️⃣ Сноровка 2
            3️⃣ Удача 1
            4️⃣ Хитрость 0
            5️⃣ Шарм 0
            """,
            "-1", "2", "1", "0", "0"
        ],
        'ремесленник': [
            """
            1️⃣ Мощь 0
            2️⃣ Сноровка 1
            3️⃣ Удача 0
            4️⃣ Хитрость 2
            5️⃣ Шарм -1
            """,
            "0", "1", "0", "2", "-1"
        ],
        'скиталец': [
            """
            1️⃣ Мощь 0
            2️⃣ Сноровка -1
            3️⃣ Удача 0
            4️⃣ Хитрость 1
            5️⃣ Шарм 2
            """,
            "0", "-1", "0", "1", "2"
        ]
    }
    return traits_map[archetype.lower()]