def weapon_skill_choice(archetype):
    weapon_skill_map = {
        'авантюрист': [
            """
            """,
            "Импровизированное оружие",
            "Парирование",
            "Стрельба по группе",
            "Обезоруживание"
        ],
        'судья': [
            """
            """,
            "Парирование",
            "Пробитие",
            "Нападение на группу",
            "Обезоруживание"
        ],
        'налетчик': [
            """
            """,
            "Быстрый выстрел",
            "Обезоруживание",
            "Стрельба по группе",
            "Хитрый выстрел"
        ],

        'следопыт': [
            """
            """,
            "Жестокий удар",
            "Срельба по группе",
            "Пробитие",
            "Обезоруживание"
        ],
        'ронин': [
            """
            """,
            "Жестокий удар",
            "Нападение на группу",
            "Пробитие",
            "Срельба по группе"
        ],
        'поджигатель': [
            """
            """,
            "Жестокий удар",
            "Быстрый выстрел",
            "Импровизированное оружие",
            "Сбивание с толку"
        ],
        'вор': [
            """
            """,
            "Парирование",
            "Хитрый выстрел",
            "Импровизированное оружие",
            "Сбивание с толку"
        ],
        'ремесленник': [
            """
            """,
            "Хитрый выстрел",
            "Пробитие",
            "Импровизированное оружие",
            "Стрельба по группе"
        ],
        'скиталец': [
            """
            """,
            "Быстрый выстрел",
            "Жестокий удар",
            "Импровизированное оружие",
            "Стрельба по группе"
        ],
    }
    return weapon_skill_map[archetype.lower()]